Repository: THEGOSTOFTOWER/PuhtonProject_PreciousSource
Catalog: habit/locale/*/LC_MESSAGES/messages.po
Languages: ru

source: My Habits
ru: Мои привычки

source: Create Habit
ru: Создать привычку

source: Statistics
ru: Статистика

source: Charts
ru: Графики

source: Help
ru: Помощь

source: Daily
ru: Ежедневно

source: Weekly
ru: Еженедельно

source: Monthly
ru: Ежемесячно

source: Cancel
ru: Отмена

source: Main Menu
ru: Главное меню

source: Overview Chart
ru: Обзорный график

source: Progress for {}
ru: Прогресс для {}

source: Date
ru: Дата

source: Completion
ru: Выполнение

source: Completed: {}/{} days ({:.1f}%)
ru: Выполнено: {}/{} дней ({:.1f}%)

source: Completion Rate (30 days)
ru: Процент выполнения (30 дней)

source: Percentage (%)
ru: Процент (%)

source: Current Streaks
ru: Текущие серии

source: Days
ru: Дни

source: 🌐 Welcome to Habit Tracker! Please select your preferred language:
ru: 🌐 Добро пожаловать в Habit Tracker! Выберите предпочитаемый язык:

source: Friend
ru: Друг

source: 🎯 Hello, {}! Welcome to Habit Tracker! Track your habits with analytics and charts. Choose an action:
ru: 🎯 Привет, {}! Добро пожаловать в Habit Tracker! Отслеживайте свои привычки с аналитикой и графиками. Выберите действие:

source: 🎯 Hello, {}! Language set to {}. Track your habits with analytics and charts. Choose an action:
ru: 🎯 Привет, {}! Язык установлен на {}. Отслеживайте свои привычки с аналитикой и графиками. Выберите действие:

source: Welcome to Habit Tracker!
ru: Добро пожаловать в Habit Tracker!

source: 🌐 Select your preferred language:
ru: 🌐 Выберите предпочитаемый язык:

source: ❌ Error: {}
ru: ❌ Ошибка: {}

source: 🎯 Habit Tracker - Main Menu Choose an action:
ru: 🎯 Habit Tracker - Главное меню Выберите действие:

source: 📝 No active habits. Create your first habit!
ru: 📝 Нет активных привычек. Создайте свою первую привычку!

source: 📋 Your active habits:
ru: 📋 Ваши активные привычки:

source: Created
ru: Создано

source: Click a habit to mark it as completed:
ru: Нажмите на привычку, чтобы отметить её выполненной:

source: ➕ Create a new habit 📖 **Step 1/3**: Enter the habit name Examples: • Morning exercise • Reading • Meditation
ru: ➕ Создать новую привычку 📖 **Шаг 1/3**: Введите название привычки Примеры: • Утренняя зарядка • Чтение • Медитация

source: ❌ Name too long (max 100 chars). Try again:
ru: ❌ Название слишком длинное (макс. 100 символов). Попробуйте снова:

source: ✅ Name: {} 📖 **Step 2/3**: Choose the frequency:
ru: ✅ Название: {} 📖 **Шаг 2/3**: Выберите периодичность:

source: ❌ Description too long (max 500 chars). Try again:
ru: ❌ Описание слишком длинное (макс. 500 символов). Попробуйте снова:

source: ✅ Name: {} ✅ Frequency: {} 📖 **Step 3/3**: Enter a description (optional)
ru: ✅ Название: {} ✅ Периодичность: {} 📖 **Шаг 3/3**: Введите описание (необязательно)

source: Skip
ru: Пропустить

source: 🎉 Habit created! ✅ Name: {} ✅ Description: {} ✅ Frequency: {} Start tracking now!
ru: 🎉 Привычка создана! ✅ Название: {} ✅ Описание: {} ✅ Периодичность: {} Начните отслеживать сейчас!

source: None
ru: Нет

source: frequency
ru: периодичность

source: ❌ Error creating habit: {}
ru: ❌ Ошибка при создании привычки: {}

source: ❌ Habit not found
ru: ❌ Привычка не найдена

source: ✅ {} already completed today! ⏰ Time: {} Keep it up!
ru: ✅ {} уже выполнено сегодня! ⏰ Время: {} Так держать!

source: Back to Habits
ru: Назад к привычкам

source: Completed by {}
ru: Выполнено {}

source: 🎉 {} completed! ⏰ Time: {} 🔥 Streak: {} days 🏆 Longest streak: {} days 📈 Total: {} times
ru: 🎉 {} выполнено! ⏰ Время: {} 🔥 Серия: {} дней 🏆 Рекордная серия: {} дней 📈 Всего: {} раз

source: 📊 No habits available. Create your first habit!
ru: 📊 Нет доступных привычек. Создайте свою первую привычку!

source: 📊 Habit Statistics:
ru: 📊 Статистика привычек:

source: Completions
ru: Выполнения

source: Streak
ru: Серия

source: days
ru: дней

source: Longest
ru: Рекорд

source: Rate
ru: Процент

source: Last
ru: Последнее

source: Overall
ru: Общее

source: Habits
ru: Привычки

source: Today
ru: Сегодня

source: Total
ru: Всего

source: Streaks
ru: Серии

source: 📈 No habits for charts. Create your first habit!
ru: 📈 Нет привычек для графиков. Создайте свою первую привычку!

source: 📈 Progress Charts Select a habit or view overview:
ru: 📈 Графики прогресса Выберите привычку или просмотрите обзор:

source: 📊 Overview of all habits Shows completion rates and streaks.
ru: 📊 Обзор всех привычек Показывает процент выполнения и серии.

source: ❌ Unable to generate chart
ru: ❌ Не удалось создать график

source: 📈 Chart for {} ✅ Completions: {} 🔥 Streak: {} days 🏆 Longest: {} days 📈 Rate: {:.1f}%
ru: 📈 График для {} ✅ Выполнений: {} 🔥 Серия: {} дней 🏆 Рекорд: {} дней 📈 Процент: {:.1f}%

source: Back to Charts
ru: Назад к графикам

source: 📈 Chart sent above
ru: 📈 График отправлен выше

source: 🆘 Habit Tracker Help 📖 Track habits with analytics and charts. 🚀 Features: • Create habits • Track completions • View stats • Generate charts 📱 Commands: /start - Start bot /language - Change language 💡 Tips: • Mark habits daily • Use charts for motivation Good luck! 🚀
ru: 🆘 Помощь по Habit Tracker 📖 Отслеживайте привычки с аналитикой и графиками. 🚀 Возможности: • Создавайте привычки • Отслеживайте выполнения • Просматривайте статистику • Генерируйте графики 📱 Команды: /start - Запустить бота /language - Изменить язык 💡 Советы: • Отмечайте привычки ежедневно • Используйте графики для мотивации Удачи! 🚀

source: ❌ Bot error. Try again later.
ru: ❌ Ошибка бота. Попробуйте позже.

source: Starting bot...
ru: Запуск бота...
